#ETL (Extract, Transform, Load) *Process*

##Load the CSV file (using Python).

In [1]:
# Load the Pandas libraries with alias 'pd' 
import numpy as np
import pandas as pd
# Read data from file 'filename.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 
url = 'https://drive.google.com/file/d/1B0EUA2Y76IqtmPeY6HwVEmaWucw81Ndq/view?usp=sharing'
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
df = pd.read_csv(path)
###Top 
df.head()

         Date  Station Area   Description  ...        AH       MAV        CD
0  01/01/2013   Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1  01/01/2013      Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2  01/01/2013  North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3  01/01/2013      Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4  01/01/2013       Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47

[5 rows x 11 columns]

In [2]:
df['TOC'] = pd.to_datetime(df['Date'] + ' ' + df['TOC'])
df['ORD'] = pd.to_datetime(df['Date'] + ' ' + df['ORD'])
adf = df['Date']
df['Date'] =  pd.to_datetime(df['Date'])
df.head()

        Date  Station Area   Description  ...        AH       MAV        CD
0 2013-01-01   Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1 2013-01-01      Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2 2013-01-01  North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3 2013-01-01      Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4 2013-01-01       Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47

[5 rows x 11 columns]

##Output the total number of rows and columns.

In [3]:
##Count of Columns and Rows
No_of_col = df.shape[1]
No_of_rows = df.shape[0]
print(f"Total Number of Columns in the Dataset is {No_of_col}")
print(f"Total Number of Rows in the Dataset is {No_of_rows:,}")

Total Number of Columns in the Dataset is 11
Total Number of Rows in the Dataset is 38,556

##Output the number of non-null rows (by column).

In [4]:
##Count of Not null columns
Non_Null_columns = df.count()
print("Total Number of Non Null Values by Columns in the Dataset")
print(Non_Null_columns)

Total Number of Non Null Values by Columns in the Dataset
Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

##Output the number of null values (by column)

In [5]:
##Output the number of null values (by column)
Null_Columns = df.isnull().sum()
print("Total Number of Null Values by Columns in the Dataset")
print(Null_Columns)

Total Number of Null Values by Columns in the Dataset
Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

##Output the number of null values for all columns

In [6]:
#Count of Null columns
Total_Null_col = df.isnull().sum().sum()
print(f"Total Number of Null Values in the Dataset : {Total_Null_col:,}")

Total Number of Null Values in the Dataset : 47,294

##Output the total number of call outs by Station Area

In [7]:
 df.groupby('Station Area').TOC.agg(['count'])

 #df.groupby('A').B.agg(['min', 'max'])

                count
Station Area
Balbriggan        688
Blanchardstown   2089
Dolphins Barn    4018
Donnybrook       1787
Dun Laoghaire    3271
Dunshaughlin        2
Finglas          3030
Kilbarrack       3548
MH14                1
North Strand     1645
Phibsborough     3160
Rathfarnham      2129
Skerries          449
Swords           2614
Tallaght         6525
Tara St          3600

##Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.

In [8]:
df.groupby(['Station Area','Date']).TOC.agg(['count'])

                         count
Station Area Date
Balbriggan   2013-01-01      3
             2013-01-03      1
             2013-01-04      1
             2013-01-05      1
             2013-01-07      2
...                        ...
Tara St      2015-12-26      7
             2015-12-27      3
             2015-12-29      2
             2015-12-30      1
             2016-08-16      1

[12483 rows x 1 columns]

##Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.

In [9]:
df[(df.Description == 'Fire CAR') | (df.Description == 'Fire ALARM')].groupby(['Station Area','Date']).TOC.agg(['count'])

                         count
Station Area Date
Balbriggan   2013-01-01      3
             2013-01-04      1
             2013-01-05      1
             2013-01-20      1
             2013-01-24      1
...                        ...
Tara St      2015-12-21      1
             2015-12-25      4
             2015-12-26      6
             2015-12-29      1
             2015-12-30      1

[6792 rows x 1 columns]

##Replace any instance of “,” (in any column) with an empty string.

In [10]:
#Checking if the Value "," exists in the Dataset
exists = ',' in df.values
print(exists)

True

In [11]:
#Replacing the "," with an empty String
df = df.replace([','],'')

In [12]:
#Confirming the Replacement Worked
exists = ',' in df.values
print(exists)

False

##Replace any instance of “-” (in any column) with an empty string.

In [13]:
#Checking if the Value "-" exists in the Dataset
exists = '-' in df.values
print(exists)

True

In [14]:
#Replacing the "-" with an empty String
df = df.replace(['-'],'')

In [15]:
#Confirming the Replacement Worked
exists = '-' in df.values
print(exists)

False

##Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL

In [16]:
#Drop Na Values as seen above
#Null Values for the columns are AH = 38,403 MAV = 26 CD = 26
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset before Null rows are removed are removed {No_of_rows}")

df = df.dropna(subset=['AH', 'MAV','CD'])

print("Null Rows Removed")

No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset After Null rows are removed {No_of_rows}")

Total Number of Rows in the Dataset before Null rows are removed are removed 38556
Null Rows Removed
Total Number of Rows in the Dataset After Null rows are removed 153

##Drop any duplicate rows (except for the first occurrence).

In [17]:
#Column Count After removing Nulls
##Count of Rows
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset before Duplicates are removed {No_of_rows}")

df = df.drop_duplicates(keep='first')
print("Duplcates removed")
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset After Duplicates are removed {No_of_rows}")

Total Number of Rows in the Dataset before Duplicates are removed 153
Duplcates removed
Total Number of Rows in the Dataset After Duplicates are removed 152

##Output the minimum time difference between TOC and ORD.

In [18]:
##Add new Column that shows the time difference between TOC and ORD
df["Diff_ORD_TOC"] = (df['ORD'] -df['TOC'])

##Get the Minimum time difference
Min_TOC_ORD = min(df["Diff_ORD_TOC"]).seconds
print(f"The Minimum time diffrence between time the call is received in the control centre and time the vehicle is mobilised to the incident by a control operator is : {Min_TOC_ORD} seconds")

The Minimum time diffrence between time the call is received in the control centre and time the vehicle is mobilised to the incident by a control operator is : 30 seconds

##Export

In [19]:
%%sh
curl https://packages.microsoft.com/keys/microsoft.asc | apt-key add -
curl https://packages.microsoft.com/config/ubuntu/16.04/prod.list > /etc/apt/sources.list.d/mssql-release.list
sudo apt-get update
sudo ACCEPT_EULA=Y apt-get -q -y install msodbcsql17

OK
Get:1 https://packages.microsoft.com/ubuntu/16.04/prod xenial InRelease [4,003 B]
Get:2 https://cloud.r-project.org/bin/linux/ubuntu bionic-cran40/ InRelease [3,626 B]
Ign:3 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  InRelease
Get:4 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic InRelease [15.9 kB]
Get:5 http://security.ubuntu.com/ubuntu bionic-security InRelease [88.7 kB]
Ign:6 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  InRelease
Hit:7 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  Release
Get:8 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 Packages [198 kB]
Get:9 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  Release [564 B]
Hit:10 http://archive.ubuntu.com/ubuntu bionic InRelease
Get:11 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  Release.gpg [833 B]
Get:12 http://archive.ubuntu.com/ubuntu bionic-updates InRelease [88.7 kB]
Get:13 https://cloud.r-project.org/bin/linux/ubuntu bionic-cran40/ Packages [43.6 kB]
Hit:15 http://ppa.launchpad.net/cran/libgit2/ubuntu bionic InRelease
Get:16 http://ppa.launchpad.net/graphics-drivers/ppa/ubuntu bionic InRelease [21.3 kB]
Get:17 http://archive.ubuntu.com/ubuntu bionic-backports InRelease [74.6 kB]
Get:18 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  Packages [66.5 kB]
Get:19 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic/main Sources [1,708 kB]
Get:20 http://security.ubuntu.com/ubuntu bionic-security/main amd64 Packages [1,881 kB]
Get:21 http://archive.ubuntu.com/ubuntu bionic-updates/multiverse amd64 Packages [45.6 kB]
Get:22 http://archive.ubuntu.com/ubuntu bionic-updates/main amd64 Packages [2,307 kB]
Get:23 http://security.ubuntu.com/ubuntu bionic-security/universe amd64 Packages [1,376 kB]
Get:24 http://security.ubuntu.com/ubuntu bionic-security/restricted amd64 Packages [284 kB]
Get:25 http://archive.ubuntu.com/ubuntu bionic-updates/restricted amd64 Packages [309 kB]
Get:26 http://archive.ubuntu.com/ubuntu bionic-updates/universe amd64 Packages [2,140 kB]
Get:27 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic/main amd64 Packages [875 kB]
Get:28 http://ppa.launchpad.net/graphics-drivers/ppa/ubuntu bionic/main amd64 Packages [49.2 kB]
Fetched 11.6 MB in 3s (4,563 kB/s)
Reading package lists...
Reading package lists...
Building dependency tree...
Reading state information...
The following additional packages will be installed:
  libodbc1 odbcinst odbcinst1debian2 unixodbc
Suggested packages:
  unixodbc-bin
The following NEW packages will be installed:
  msodbcsql17 unixodbc
The following packages will be upgraded:
  libodbc1 odbcinst odbcinst1debian2
3 upgraded, 2 newly installed, 0 to remove and 46 not upgraded.
Need to get 1,420 kB of archives.
After this operation, 191 kB of additional disk space will be used.
Get:1 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 libodbc1 amd64 2.3.7 [511 kB]
Get:2 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 odbcinst amd64 2.3.7 [12.0 kB]
Get:3 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 odbcinst1debian2 amd64 2.3.7 [135 kB]
Get:4 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 unixodbc amd64 2.3.7 [19.6 kB]
Get:5 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 msodbcsql17 amd64 17.6.1.1-1 [743 kB]
Fetched 1,420 kB in 0s (6,996 kB/s)
(Reading database ... 145483 files and directories currently installed.)
Preparing to unpack .../libodbc1_2.3.7_amd64.deb ...
Unpacking libodbc1:amd64 (2.3.7) over (2.3.4-1.1ubuntu3) ...
Preparing to unpack .../odbcinst_2.3.7_amd64.deb ...
Unpacking odbcinst (2.3.7) over (2.3.4-1.1ubuntu3) ...
Preparing to unpack .../odbcinst1debian2_2.3.7_amd64.deb ...
Unpacking odbcinst1debian2:amd64 (2.3.7) over (2.3.4-1.1ubuntu3) ...
Selecting previously unselected package unixodbc.
Preparing to unpack .../unixodbc_2.3.7_amd64.deb ...
Unpacking unixodbc (2.3.7) ...
Selecting previously unselected package msodbcsql17.
Preparing to unpack .../msodbcsql17_17.6.1.1-1_amd64.deb ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Unpacking msodbcsql17 (17.6.1.1-1) ...
Setting up libodbc1:amd64 (2.3.7) ...
Setting up odbcinst1debian2:amd64 (2.3.7) ...
Setting up odbcinst (2.3.7) ...
Setting up unixodbc (2.3.7) ...
Setting up msodbcsql17 (17.6.1.1-1) ...
Processing triggers for libc-bin (2.27-3ubuntu1.2) ...
/sbin/ldconfig.real: /usr/local/lib/python3.6/dist-packages/ideep4py/lib/libmkldnn.so.0 is not a symbolic link

Processing triggers for man-db (2.8.3-2ubuntu0.1) ...

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   983  100   983    0     0   7227      0 --:--:-- --:--:-- --:--:--  7227
Warning: apt-key output should not be parsed (stdout is not a terminal)
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    79  100    79    0     0   1097      0 --:--:-- --:--:-- --:--:--  1097
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 5.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:

In [20]:
#Preparing the columns for upload into an SQL database
df['MOB'] = pd.to_datetime(adf + ' ' + df['MOB'])
df['IA'] = pd.to_datetime(adf + ' ' + df['IA'])
df['LS'] = pd.to_datetime(adf + ' ' + df['LS'])
df['AH'] = pd.to_datetime(adf + ' ' + df['AH'])
df['MAV'] = pd.to_datetime(adf + ' ' + df['MAV'])
df['CD'] = pd.to_datetime(adf + ' ' + df['CD'])
df=df.rename(columns = {'Station Area':'Station_Area'})
df.head()

        Date  Station_Area  ...                  CD    Diff_ORD_TOC
0 2013-01-01   Rathfarnham  ... 2013-01-01 03:08:54 0 days 00:01:39
1 2013-01-01      Tallaght  ... 2013-01-01 03:05:43 0 days 00:00:43
2 2013-01-01  North Strand  ... 2013-01-01 04:51:20 0 days 00:00:50
3 2013-01-01      Tallaght  ... 2013-01-01 05:30:48 0 days 00:01:05
4 2013-01-01       Finglas  ... 2013-01-01 05:30:47 0 days 00:01:12

[5 rows x 12 columns]

In [21]:
!apt install unixodbc-dev
!pip install pyodbc
import pyodbc
import getpass
server = 'sos.database.windows.net'
database = 'Assessments'
username = input('Username : ')
password = getpass.getpass('Password :: ') 
driver= '{ODBC Driver 17 for SQL Server}'

with pyodbc.connect('DRIVER='+driver+';SERVER='+server+';PORT=1433;DATABASE='+database+';UID='+username+';PWD='+ password) as conn:
  with conn.cursor() as cursor:
    for index, row in df.iterrows():
      cursor.execute("INSERT INTO dbo.CallOuts(Date,Station_Area,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD) values(?,?,?,?,?,?,?,?,?,?,?)",row.Date, row.Station_Area, row.Description,row.TOC,row.ORD,row.MOB,row.IA,row.LS,row.AH,row.MAV,row.CD)
conn.commit()
cursor.close()
print("Data Uploaded to table on SQL server successfully")

Reading package lists... Done
Building dependency tree
Reading state information... Done
The following NEW packages will be installed:
  unixodbc-dev
0 upgraded, 1 newly installed, 0 to remove and 46 not upgraded.
Need to get 37.1 kB of archives.
After this operation, 1,739 kB of additional disk space will be used.
Get:1 https://packages.microsoft.com/ubuntu/16.04/prod xenial/main amd64 unixodbc-dev amd64 2.3.7 [37.1 kB]
Fetched 37.1 kB in 0s (293 kB/s)
Selecting previously unselected package unixodbc-dev.
(Reading database ... 145477 files and directories currently installed.)
Preparing to unpack .../unixodbc-dev_2.3.7_amd64.deb ...
Unpacking unixodbc-dev (2.3.7) ...
Setting up unixodbc-dev (2.3.7) ...
Collecting pyodbc
  Downloading https://files.pythonhosted.org/packages/81/0d/bb08bb16c97765244791c73e49de9fd4c24bb3ef00313aed82e5640dee5d/pyodbc-4.0.30.tar.gz (266kB)
     |████████████████████████████████| 276kB 4.2MB/s
Building wheels for collected packages: pyodbc
  Building wheel for pyodbc (setup.py) ... done
  Created wheel for pyodbc: filename=pyodbc-4.0.30-cp36-cp36m-linux_x86_64.whl size=272704 sha256=694b901222ee185bf784e4bc2f0f58bc5efa3af2d535862bfdd64f9c8fdc4266
  Stored in directory: /root/.cache/pip/wheels/4a/02/ba/6b495fec7cb127583a769a74f3ba91eb700d73e25fbb5ba09b
Successfully built pyodbc
Installing collected packages: pyodbc
Successfully installed pyodbc-4.0.30
Username : Samuel
Password :: ··········
Data Uploaded to table on SQL server successfully